# print('#1')
# my_dict = {i: i ** 3 for i in range(1, 11)}
# print(my_dict)

# print('#2')
# dictionary_1 = {'a': 300, 'b': 400}
# dictionary_2 = {'c': 500, 'd': 600}
# dictionary_1.update(dictionary_2)  # Объединяет словари внося данные в dictionary_1
# print('dictionary_1', dictionary_1)
# merged_dict = dictionary_1 | dictionary_2  # Объединение словарей в новой созданой переменной
# print('merged_dict', merged_dict)
# merged_dict = {**dictionary_1, **dictionary_2}  # Объединение словарей в новой созданой переменной
# print('merged_dict', merged_dict)

# print('#3')
# my_dict = {'data1': 375, 'data2': 567, 'data3': -37, 'data4': 21}
# result = 1
# for i in my_dict:
#     result *= my_dict[i]
# print(result)

# print('#4')
# keys = ['red', 'green', 'blue']
# values = ['#FF0000', '#008000', '#0000FF']
# key_dict = dict.fromkeys(keys)  # Превращаем список в словарь при помощи dict.fromkeys()
# print(key_dict)
# color_keys = dict(zip(keys, values))  # Конвертируем два списка в словарь при помощи zip()
# print(color_keys)

# print('#5')
# string = 'hello world'
# print(string)
# my_dict = {symbol: string.count(symbol) for symbol in string}
# print(my_dict)

# Упражнение 53. Азбука Морзе. Азбука Морзе зашифровывает буквы и цифры при помощи
# точек и тире. В данном упражнении вам необходимо написать программу, в которой
# соответствие символов из азбуки Морзе будет храниться в виде словаря. В табл. 6.3
# приведена та часть азбуки, которая вам понадобится при решении этого задания. В
# основной программе вам необходимо запросить у пользователя строку. После этого
# программа должна преобразовать его в соответствующую последовательность точек
# и тире, вставляя пробелы между отдельными символами. Символы, не представленные
# в таблице, можно игнорировать. Например, сообщение Hello, World! может быть
# представлено следующей последовательностью: .... . .–.. .–.. ––– .–– ––– .–. .–.. –..


morse = {'А': '*-', 'Б': '-***', 'В': '*--',
         'Г': '--*', 'Д': '-**', 'Е': '*',
         'Ж': '***-', 'З': '--**', 'И': '**',
         'Й': '*---', 'К': '-*-', 'Л': '*-**',
         'М': '--', 'Н': '-*', 'О': '---', 'П': '*--*',
         'Р': '*-*', 'С': '***', 'Т': '-', 'У': '**-',
         'Ф': '**-*', 'Х': '****', 'Ц': '-*-*', 'Ч': '---*',
         'Ш': '----', 'Щ': '--*-', 'Ъ': '*--*-*', 'Ы': '-*--',
         'Ь': '-**-', 'Э': '**-**', 'Ю': '**--', 'Я': '*-*-',
         'A': '.-', 'B': '-...',
         'C': '-.-.', 'D': '-..', 'E': '.',
         'F': '..-.', 'G': '--.', 'H': '....',
         'I': '..', 'J': '.---', 'K': '-.-',
         'L': '.-..', 'M': '--', 'N': '-.',
         'O': '---', 'P': '.--.', 'Q': '--.-',
         'R': '.-.', 'S': '...', 'T': '-',
         'U': '..-', 'V': '...-', 'W': '.--',
         'X': '-..-', 'Y': '-.--', 'Z': '--..',
         '1': '.----', '2': '..---', '3': '...--',
         '4': '....-', '5': '.....', '6': '-....',
         '7': '--...', '8': '---..', '9': '----.',
         '0': '-----', ', ': '--..--', '.': '.-.-.-',
         '?': '..--..', '/': '-..-.', '-': '-....-',
         '(': '-.--.', ')': '-.--.-'}

text = input().upper().split()
for word in text:
    print(''.join([morse[letter] for letter in word]))
